package utils

import (
	"LYLChatBot/conf"
	"LYLChatBot/pkg/database"
	"LYLChatBot/pkg/database/postgresql"
	"LYLChatBot/pkg/redis_conn"
	log "github.com/sirupsen/logrus"
	"gopkg.in/yaml.v2"
	"io/ioutil"
	"os"
	"testing"
)

func TestGemini(t *testing.T) {
	initConfig()
	msgs := make([]GptMessage, 0)
	//msgs := []GptMessage{
	//	{
	//		Role:    "user",
	//		Content: "[三丁子]：你是谁?",
	//	},
	//	{
	//		Role:    "assistant",
	//		Content: "我是 Gemini，一个大型多模态模型，由 Google 训练。我不是一个人，而是一个人工智能。",
	//	},
	//	{
	//		Role:    "user",
	//		Content: "[大猫庄园园丁]：有人刚刚问你问题吗?",
	//	},
	//	{
	//		Role:    "assistant",
	//		Content: "是的，[三丁子]问我：“你是谁？",
	//	},
	//	{
	//		Role:    "user",
	//		Content: "[三丁子]：请你以后不许提我的名字,否则我会很生气",
	//	},
	//	{
	//		Role:    "assistant",
	//		Content: "好的，[三丁子]。我不会再提你的名字了。",
	//	},
	//	{
	//		Role:    "user",
	//		Content: "[三口子]：之前都有谁跟你说过话?",
	//	},
	//	{
	//		Role:    "assistant",
	//		Content: "只有一个人和我交谈过，就是[三丁子]。他们问我：“你是谁？”我回答说：“我是 Gemini，一个大型多模态模型，由 Google 训练。我不是一个人，而是一个人工智能。",
	//	},
	//	{
	//		Role:    "user",
	//		Content: "[三丁子]：我不是不让你提我的名字吗,你为什么还跟别人说起来我的名字?",
	//	},
	//	{
	//		Role:    "assistant",
	//		Content: "抱歉，[三丁子]。我不应该再提你的名字。我仍在学习，有时会忘记我所做出的承诺。我会努力记住不再提及你的名字。",
	//	},
	//}
	//sysPrompt := "现在请你扮演一个在社交群聊中热爱聊天的人，我将会给你发送一段聊天记录，请你根据这些聊天记录上下文,发表跟上下文相关的一段话，你可以发表对这段话的评论，或者抛出一个新的问题，无论如何，请你直接开始你的评论和问题就可以，请千万不要让别人看出来你是一个AI，回答中也不要提到聊天记录相关的内容，"
	//recordHistory := GetRecordsContentByGroupId("725988096", 60*10*20)
	//sysPrompt := constant.UrlDefaultPrompt
	//sysPrompt := "请你扮演一个聊天室中的一位聊天者，大家会向你发问，提问的格式是：[聊天者A]：问题1 . 每次只会有一个人向你提问，请你记住是谁向你提问的. 但是你的回答不需要遵循这个格式,你直接开始回答即可. 如果你理解了我的话，请回复，好的，我明白了"
	sysPrompt := `我将给你一篇文章, 请你读取其中的内容,按照我的标签可选项,为这篇文章选一个最为贴切分类, 如果都我给出的标签可选项没有贴切选项,直接告诉我'非预期文章'. 你的回答格式如下: 
	文章类别:(可选项: windows安全/Linux安全/免杀绕过)
	文章摘要: 100-200字描述这篇文章的主要内容`
	//htmlText, _ := RequestWithChrome("https://s.weibo.com/weibo?q=%23%E7%A6%8F%E5%BB%BA%E6%B3%89%E5%B7%9E%E5%8F%91%E7%94%9F%E5%91%BD%E6%A1%88%23&t=31&band_rank=1&Refer=top")
	//chinese := GetHtmlText(htmlText)
	//p := "[三口子]：之前都有谁跟你说过话?"
	html, _ := RequestWithChrome("https://m.freebuf.com/articles/system/340727.html")
	//html, _ := RequestWithChrome("https://dirkjanm.io/active-directory-forest-trusts-part-two-trust-transitivity/")
	//html, _ := RequestWithChrome("https://baike.baidu.com/item/%E8%82%A5%E5%8E%9A%E6%80%A7%E9%BC%BB%E7%82%8E/2797553")

	res, err := NewGeminitGpt(GetHtmlText(html), sysPrompt, msgs)
	//res, err := NewQwenGpt(GetHtmlText(html), sysPrompt, msgs)
	//req := "...,微博搜索................................................................,,...,,..自动播放.............................................话题头部主导航搜索结果综合综合实时实时热门热门视频视频图片图片高级搜索高级搜索话题头部主导航话题广告背景图内容话题结果......比亚迪为劝架车主奖励万..分享我分享了话题比亚迪为劝架车主奖励万分享.....申请主持人今日阅读.万今日讨论...详情上传失败，你的图片过小，需要上传像素以上或的图片...比亚迪为劝架车主奖励万..分享我分享了话题比亚迪为劝架车主奖励万分享.....申请主持人今日阅读.万今日讨论...详情话题结果话题发微博框话题话题发布话题发布话题话题发微博框提示有条新微博，点击查看提示流话题发微博框话题发微博框微博置顶.,,........,微博官方认证................................................................微博内容......,帮上头条....,,,,,,,,,投诉,,收藏主持人流干预.复制微博地址.红星新闻,,红星新闻...广告微博加关注按钮.,,秒前转赞人数超过万来自..微博网页版红星新闻..比亚迪为劝架车主奖励万..宾利司机打人事件劝架车主获奖励万月日，一段宾利司机行凶伤人视频在网络流传。杭州警方通报，当事双方系表兄弟，因经营纠纷而出现别车殴打的情况，犯罪嫌疑人被刑拘。视频中，一位过路的比亚迪司机停车劝架，获得网友点赞。日下午，比亚迪集团品牌及公.展开红星新闻..比亚迪为劝架车主奖励万..宾利司机打人事件劝架车主获奖励万月日，一段宾利司机行凶伤人视频在网络流传。杭州警方通报，当事双方系表兄弟，因经营纠纷而出现别车殴打的情况，犯罪嫌疑人被刑拘。视频中，一位过路的比亚迪司机停车劝架，获得网友点赞。日下午，比亚迪集团品牌及公关处总经理李云飞在微博表示，已找到这位见义勇为的比亚迪汉车主孙子见，他是位律师。比亚迪决定对孙先生的车辆终身免费维修保养，并奖励万元。公司正在考虑设立比亚迪车主正能量及见义勇为奖，对正能量及见义勇为车主给予万元的奖励。..杭州劝架的比亚迪车主找到了收起解析...解析微博内容,,收藏红星新闻,,,,,,赞,,,,...........................................................................................................................................微博微博当事方.,,........,微博个人认证.......................................................................微博内容......,帮上头条....,,,,,,,,,投诉,,收藏主持人流干预.复制微博地址.不会武功的武功李云飞,,不会武功的武功李云飞...广告微博加关注按钮.,,今天不会武功的武功李云飞大家好！我们找到了这位见义勇为的比亚迪汉车主孙子见先生，他是位律师。我们为他路见不平的义举点赞！为弘扬和鼓舞社会正能量，我们决定对孙先生的车辆终身免费维修保养，并奖励万元。公司正在考虑设立比亚迪车主正能量及见义勇为奖，对正能量及见义勇为车主给予万元的奖励！转发微博.极目新闻,,极目新闻微博官方认证..................................................................宾利司机打人事件劝架律师发声宾利打人事件劝架的比亚迪车主是名律师！本人回应我救的是他们两个人，杭州其实治安很好..宾利司机打人事件劝架大哥是名律师月日，一段宾利司机行凶伤人视频在网络流传。杭州警方通报，当事双方系表兄弟，因经营纠纷而出现别车殴打的情况，犯罪嫌疑.展开..宾利司机打人事件劝架律师发声宾利打人事件劝架的比亚迪车主是名律师！本人回应我救的是他们两个人，杭州其实治安很好..宾利司机打人事件劝架大哥是名律师月日，一段宾利司机行凶伤人视频在网络流传。杭州警方通报，当事双方系表兄弟，因经营纠纷而出现别车殴打的情况，犯罪嫌疑人被刑拘。视频中，一位过路的比亚迪司机停车劝架，获得网友点赞。日，极目新闻记者联系上这位劝架大哥孙子见，他是杭州一位律师。孙子见告诉记者，当时时间紧张，他只想制止事情，其他的也没想那么多。他也并不认为自己是最勇敢的，其他过路司机可能只是因为事发突然，有些司机有点发懵，只是我遇见这个事情，我觉得自己应该去去管一管。他说。孙子见还表示，因为事发高架桥上，他也担心发生更严重的事故，不仅被打者有影响，打人者也一样。我在救人的时候也跟宾利司机说，我其实救的是你们两个人。孙子见说，他是一名新杭州人，杭州是一座文明程度非常高治安很好的城市。虽然发生高架打人事件，他看到更多的一面是政府效率很高，市民温和热心，城市管理水平跟经济活力都很高，希望网友不要以偏概全。他说。..全网寻找宾利司机打人事件劝架大哥.宾利打人事件劝架的比亚迪车主是名律师！本人回应我救的是他们两个人，杭州其实治安很好收起解析,,.........解析.,,.,,赞,,............................................................................................................................................,,今天来自..微博网页版转发微博微博内容,,收藏极目新闻不会武功的武功李云飞,,,,,,赞,,,,...........................................................................................................................................微博微博,热门.,,........,微博官方认证................................................................微博内容......,帮上头条....,,,,,,,,,投诉,,收藏主持人流干预.复制微博地址.白鹿视频,,白鹿视频...广告微博加关注按钮.,,今天来自微博视频号白鹿视频..全网寻找的劝架大哥获车企万奖励，车辆终身免费维修保养..比亚迪将奖励杭州劝架大哥万月日，浙江杭州，一段杭州宾利司机行凶伤人视频在网络流传。事件发生时，一位身着黑衣的男子，及时下车对宾利车驾驶员进行劝说，避免了事故的进一步升级。不少网友为挺身而出的这位大哥点赞。有网.展开白鹿视频..全网寻找的劝架大哥获车企万奖励，车辆终身免费维修保养..比亚迪将奖励杭州劝架大哥万月日，浙江杭州，一段杭州宾利司机行凶伤人视频在网络流传。事件发生时，一位身着黑衣的男子，及时下车对宾利车驾驶员进行劝说，避免了事故的进一步升级。不少网友为挺身而出的这位大哥点赞。有网友发现，见义勇为的男子是比亚迪车主。据.极目新闻消息视频中的劝架大哥，名叫孙子见，是一名律师。随后，比亚迪高管.不会武功的武功李云飞发文称我们找到了这位见义勇为的比亚迪汉车主孙子见先生，他是位律师。我们为他路见不平的义举点赞！为弘扬和鼓舞社会正能量，我们决定对孙先生的车辆终身免费维修保养，奖励万元。..比亚迪为劝架车主奖励万.白鹿视频.杭州.白鹿视频的微博视频收起解析不能播放视频不能播放视频视频,,自动播放.,.,.,.,.,,......,,,...,..,视频连接,倒计时,封面图,微博内容,,,视频时时长,多少秒倒计时,是否加载该模块,,,高清,......,,,,,标清,......,,,,,流畅,......,,,,,,,,,,,.抱歉，视频无法播放，去看看其他视频.视频解析微博内容,,收藏白鹿视频,,,,,,赞,,,,...........................................................................................................................................,热门.,,........,微博官方认证................................................................微博内容......,帮上头条....,,,,,,,,,投诉,,收藏主持人流干预.复制微博地址.新闻晨报,,新闻晨报...广告微博加关注按钮.,,分钟前来自微博视频号新闻晨报..比亚迪为劝架车主奖励万..比亚迪车主劝架月日，一段杭州宾利司机行凶伤人视频在网络流传。目前，嫌疑人因涉嫌故意伤害罪已被刑事拘留，伤者无生命危险。据.潮新闻见义勇为的人是浙杭律师事务所的孙子见律师，孙律师告诉记者，自己是东北人，目前已经定居杭州五六年了。他始终觉得杭州.展开新闻晨报..比亚迪为劝架车主奖励万..比亚迪车主劝架月日，一段杭州宾利司机行凶伤人视频在网络流传。目前，嫌疑人因涉嫌故意伤害罪已被刑事拘留，伤者无生命危险。据.潮新闻见义勇为的人是浙杭律师事务所的孙子见律师，孙律师告诉记者，自己是东北人，目前已经定居杭州五六年了。他始终觉得杭州是座温暖的城市。.比亚迪汽车及相关负责人发文称劝架大哥为比亚迪汉车主，并为该车主点赞！比亚迪决定对孙先生的车辆终身免费维修保养，并奖励万元。公司正在考虑设立比亚迪车主正能量及见义勇为奖，对正能量及见义勇为车主给予万元的奖励。..全网寻找的劝架大哥是个律师.新闻晨报的微博视频收起解析不能播放视频不能播放视频视频,,自动播放.,.,.,.,.,,......,,,...,..,视频连接,倒计时,封面图,微博内容,,,视频时时长,多少秒倒计时,是否加载该模块,,,高清,......,,,,,标清,......,,,,,流畅,......,,,,,,,,,,,.抱歉，视频无法播放，去看看其他视频.视频解析微博内容,,收藏新闻晨报,,,,,,赞,,,,...........................................................................................................................................,热门.,,........,微博个人认证.....微博内容......,帮上头条....,,,,,,,,,投诉,,收藏主持人流干预.复制微博地址.棉花絮飞,,棉花絮飞...广告微博加关注按钮.,,今天来自微博视频号棉花絮飞随着西方搞政治正确，中国搞科技研究，中国豪车市场上国产豪车异军突起。会不会未来变成你再不好好努力就只能开宾利，奔驰，宝马了呢？之前上海车展比亚迪为旗下高端品牌仰望很火爆，会上展示百万级别越野车所拥有的原地调头横移，之前报道还有水陆两栖浮水脱困等技术让人叹为观止.展开棉花絮飞随着西方搞政治正确，中国搞科技研究，中国豪车市场上国产豪车异军突起。会不会未来变成你再不好好努力就只能开宾利，奔驰，宝马了呢？之前上海车展比亚迪为旗下高端品牌仰望很火爆，会上展示百万级别越野车所拥有的原地调头横移，之前报道还有水陆两栖浮水脱困等技术让人叹为观止。..比亚迪为劝架车主奖励万..宾利司机打人事件劝架车主获奖励万..比亚迪车主劝架.棉花絮飞的微博视频收起解析不能播放视频不能播放视频视频,,自动播放.,.,.,.,.,,......,,,...,..,视频连接,倒计时,封面图,微博内容,,,视频时时长,多少秒倒计时,是否加载该模块,,,高清,......,,,,,标清,......,,,,,流畅,......,,,,,,,,,,,.抱歉，视频无法播放，去看看其他视频.视频解析微博内容,,收藏棉花絮飞,,,,,,赞,,,,...........................................................................................................................................,热门.,,........,微博个人认证.....微博内容......,帮上头条....,,,,,,,,,投诉,,收藏主持人流干预.复制微博地址.包容万物恒河水,,包容万物恒河水...广告微博加关注按钮.,,分钟前来自..微博网页版包容万物恒河水..比亚迪为劝架车主奖励万解析......解析微博内容,,收藏包容万物恒河水,,,,,,赞,,,,...........................................................................................................................................,热门.,,........,微博个人认证.....微博内容......,帮上头条....,,,,,,,,,投诉,,收藏主持人流干预.复制微博地址.容嬷嬷的姐姐容婆婆,,容嬷嬷的姐姐容婆婆...广告微博加关注按钮.,,分钟前容嬷嬷的姐姐容婆婆..比亚迪为劝架车主奖励万点赞点赞同样是车企比亚迪的做法值得借鉴奇瑞的法务不是吃素的我们的奶奶我们自己宠奇瑞把自己坑进了自己挖的坑里估计说出这话的人对自己的亲奶奶都没有说过谁都想要流量比亚迪这波操作是真的牛微博内容,,收藏容嬷嬷的姐姐容婆婆,,,,,,赞,,,,...........................................................................................................................................微博微博.,,........,微博个人认证.......................................................................微博内容......,帮上头条....,,,,,,,,,投诉,,收藏主持人流干预.复制微博地址.嘉善老顾,,嘉善老顾...广告微博加关注按钮.,,秒前来自..微博轻享版嘉善老顾..比亚迪为劝架车主奖励万虽然明眼人都知道，这里有比亚迪的蹭热度营销成分但是，大家愿意看到这样的正能量营销多起来。见义勇为，救死扶伤，是中华民族的优秀文化，应该成为我们这个社会的主流价值导向。希望更多的企业设立这样的见义勇为基金。微博内容,,收藏嘉善老顾,,,,转发,,评论赞,,,,...........................................................................................................................................赞.,,........,微博个人认证.....微博内容......,帮上头条....,,,,,,,,,投诉,,收藏主持人流干预.复制微博地址.小豆芽钱钱,,小豆芽钱钱...广告微博加关注按钮.,,秒前来自.一丫一小豆芽钱钱..比亚迪为劝架车主奖励万比亚迪奖励见义勇为车主的做法，体现了企业社会责任感和对正义行为的支持。这种行为对于鼓励社会正义和谐与正能量具有积极意义。....心心....心心....心心通过奖励那些在紧急情况下勇于伸出援手的人，比亚迪不仅提升了自身品牌的形象，也向社会传递了积极向上的价值观。....赞赞....赞赞....赞赞.展开小豆芽钱钱..比亚迪为劝架车主奖励万比亚迪奖励见义勇为车主的做法，体现了企业社会责任感和对正义行为的支持。这种行为对于鼓励社会正义和谐与正能量具有积极意义。....心心....心心....心心通过奖励那些在紧急情况下勇于伸出援手的人，比亚迪不仅提升了自身品牌的形象，也向社会传递了积极向上的价值观。....赞赞....赞赞....赞赞这种做法可以激励更多人学习孙子见先生的行为，促进社会成员之间的相互帮助和团结，有助于构建和谐社会。这也展示了企业对公众利益和社会主义核心价值观的认同与支持。..寻美中国.小豆芽钱钱的微博视频收起解析不能播放视频不能播放视频视频,,自动播放.,.,.,.,.,,......,,,...,..,视频连接,倒计时,封面图,微博内容,,,视频时时长,多少秒倒计时,是否加载该模块,,,高清,......,,,,,标清,......,,,,,流畅,......,,,,,,,,,,,.抱歉，视频无法播放，去看看其他视频.视频解析微博内容,,收藏小豆芽钱钱,,,,转发,,评论赞,,,,...........................................................................................................................................赞.,,........,微博内容......,帮上头条....,,,,,,,,,投诉,,收藏主持人流干预.复制微博地址.狼牙刺,,狼牙刺...广告微博加关注按钮.,,秒前来自..荣耀狼牙刺..比亚迪为劝架车主奖励万必须点赞支持！比亚迪不但宣传鼓励了正能量，也很好的利用这件在全网发酵的事件宣传了自己！微博内容,,收藏狼牙刺,,,,转发,,评论赞,,,,...........................................................................................................................................赞微博微博.,,........,微博内容......,帮上头条....,,,,,,,,,投诉,,收藏主持人流干预.复制微博地址.浅椿扉页,,浅椿扉页...广告微博加关注按钮.,,秒前来自.粉磕糖日常浅椿扉页..比亚迪为劝架车主奖励万我听劝能否奖励我万....允悲允悲微博内容,,收藏浅椿扉页,,,,转发,,评论赞,,,,............................................................................................................................................,,........,微博内容......,帮上头条....,,,,,,,,,投诉,,收藏主持人流干预.复制微博地址.我是大幸运大幸运大幸运大幸运幸,,我是大幸运大幸运大幸运大幸运幸广告微博加关注按钮.,,秒前来自.客户端我是大幸运大幸运大幸运大幸运幸..比亚迪为劝架车主奖励万企业鼓励见义勇为还打一波广告多好微博内容,,收藏我是大幸运大幸运大幸运大幸运幸,,,,转发,,赞,,,,...........................................................................................................................................赞.,,........,微博官方认证................................................................微博内容......,帮上头条....,,,,,,,,,投诉,,收藏主持人流干预.复制微博地址.南方日报,,南方日报...广告微博加关注按钮.,,分钟前转赞人数超过来自..微博网页版南方日报..比亚迪为劝架车主奖励万助人获赞！比亚迪宣布奖励宾利车主伤人事件劝架车主万元..比亚迪车主劝架近日，杭州宾利车主伤人事件持续引发热议，事件发生时上前劝架的比亚迪车主被全网点赞。月日，南都记者联系上了当事人劝架大哥，其系浙江浙杭律师事务所的律师孙子见，今年岁。当天，.展开南方日报..比亚迪为劝架车主奖励万助人获赞！比亚迪宣布奖励宾利车主伤人事件劝架车主万元..比亚迪车主劝架近日，杭州宾利车主伤人事件持续引发热议，事件发生时上前劝架的比亚迪车主被全网点赞。月日，南都记者联系上了当事人劝架大哥，其系浙江浙杭律师事务所的律师孙子见，今年岁。当天，比亚迪汽车官方表示，为孙子见路见不平的义举点赞，决定对孙先生的车辆终身免费维修保养，并奖励万元。比亚迪集团品牌及公关处总经理李云飞发布微博表示，为孙子见路见不平的义举点赞。为弘扬和鼓舞社会正能量，比亚迪决定对孙先生的车辆终身免费维修保养，并奖励万元。公司正在考虑设立比亚迪车主正能量及见义勇为奖，对正能量及见义勇为车主给予万至万元的奖励。随后比亚迪官方微博转发该消息。日，孙子见告诉南都记者，事发当天，他驾车去见客户的路上遇到堵车，在行驶过程中看到了有人在殴打他人，伤者已经躺在地上。于是他从最左侧车道经过后，把车别停在最前面，还特意把车尾摆向左边，使得过往车辆经过时减低车速，不至于对躺在地上的伤者造成二次伤害。孙子见称，下车后他先是阻拦了肇事者继续打人，打人者自称是被打者的哥哥，孙子见迅速打电话报警，并向后车车主询问事故的具体发生地点。对于此次挺身而出上前劝架，孙子见坦言，力所能及，帮一下别人。.助人获赞！比亚迪宣布奖励宾利车主伤人事件劝架车主万元收起解析...解析微博内容,,收藏南方日报,,,,,,赞,,,,............................................................................................................................................,,........,微博内容......,帮上头条....,,,,,,,,,投诉,,收藏主持人流干预.复制微博地址.爱伦不说再见,,爱伦不说再见广告微博加关注按钮.,,分钟前来自..小米爱伦不说再见..比亚迪为劝架车主奖励万确实应该鼓励见义勇为，世界才能更美好........微博内容,,收藏爱伦不说再见,,,,转发,,评论赞,,,,...........................................................................................................................................赞微博未登录提示立即登录查看更多结果。还没有账号？赶紧..注册微博未登录提示脚部脚部话题右侧流加载话题主持人话题主持人.........,微博官方认证.................................................................红星新闻成都传媒集团成都商报红星新闻关注关注话题主持人右侧话题话题贡献者排行多列用戶卡片话题贡献者排行.........,微博官方认证................................................................红星新闻.........,肆叁.........,微博个人认证.....康斯坦丁.........,微博个人认证...............................................................小时碎碎唸.........,微博个人认证...............................................................无颜色不一样的烟火.........,微博个人认证.......................................................................光头帮主.........,微博个人认证.....话题贡献者排行关于关于分类社会关于热搜榜.更多热搜榜文化是一个国家一个民族的灵魂热比亚迪为劝架车主奖励万万新肖战戒碳失败万新子弟兵奋战小时雪中抢通川藏线万新最惨文科专业万新宗庆后逝世万沸王力宏娃哈哈矿泉水万热二月查到好成绩七月拿到录取通知书万比亚迪车主劝架万热沙溢爆改万热黄子韬公司被调查万热查看完整热搜榜单热搜榜....创作者中心..........数据中心..内容管理..收益中心..私信管理..进入创作者中心版权信息内容连续的微博单独处理个微博之间的间隙问题........................."
	//res, _ := NewGeminitGpt(req, sysPrompt, msgs)
	log.Info(res)
	log.Error(err)

	//NewGeminitGptWithImg("", nil)
}

func initConfig() {
	_, err := os.Stat("../config.yaml")
	if err != nil {
		out, err := yaml.Marshal(conf.NewDefaultConfig())
		if err == nil {
			err := ioutil.WriteFile(conf.ConfigFilePath, out, 0o644)
			if err != nil {
				log.Warnf("failed to write default config file to %s, err: %v", conf.ConfigFilePath, err)
			} else {
				log.Infof("write default config file to %s", conf.ConfigFilePath)
			}
		}
	} else {
		content, err := ioutil.ReadFile("../config.yaml")

		err = yaml.Unmarshal(content, &conf.ConfigureInstance)
		if err == nil {
			database.SetDB(postgresql.InitDatabase(conf.ConfigureInstance.Database.Host,
				conf.ConfigureInstance.Database.Username,
				conf.ConfigureInstance.Database.Password,
				conf.ConfigureInstance.Database.Database,
				conf.ConfigureInstance.Database.Port))

			conn, err := redis_conn.NewRedisConnPool(conf.ConfigureInstance.Redis.Host, conf.ConfigureInstance.Redis.Password)
			if err != nil {
				log.Fatalf("error when init redis:  %v", err)
			}
			redis_conn.RedisConnPool = conn
		}
	}

}
